app/Views/artikel/view.php

        <div class="card-body">
            <img src="/img/artikel/<?php echo $artikel['gambar'] ?>" alt="<?php echo $artikel['judul'] ?> Thumbnail" class="img-fluid p-5">
            <p><strong>Kategori:</strong>
                <?php $kategori2 = $kategori->where('id', $artikel['kategori_id'])->get()->getResultArray()[0]['nama_kategori']; ?>
---
SELECT *
FROM `kategori`
WHERE `id` = '1'