app/Models/ArtikelModel.php

SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '3'
---
    public function getArtikelById($id)
    {
        return $this->find($id);